/*
Copyright (c) 2010, Code Aurora Forum. All rights reserved.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions
are met:

    * Redistributions of source code must retain the above copyright
      notice, this list of conditions and the following disclaimer.
    * Redistributions in binary form must reproduce the above
      copyright notice, this list of conditions and the following
      disclaimer in the documentation and/or other materials provided
      with the distribution.
    * Neither the name of Code Aurora Forum, Inc. nor the names of its
      contributors may be used to endorse or promote products derived
      from this software without specific prior written permission.

THIS SOFTWARE IS PROVIDED "AS IS" AND ANY EXPRESS OR IMPLIED
WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.


#define REG_STX_WIDTH                        0x3009
#define REG_DTX_WIDTH                        0x300A
#define REG_RMP_RST_START                    0x300B
#define REG_RMP_SIG_START                    0x300C
#define REG_RMP_LAT                          0x300D
#define REG_300E                             0x300E
#define REG_WB_BYPASS                        0x30A9
#define REG_SMP_EN                           0x3010
#define REG_RST_MX                           0x3011
#define REG_SIG_OFFSET1                      0x3012
#define REG_RST_OFFSET1                      0x3013
#define REG_SIG_OFFSET2                      0x3014
#define REG_RST_OFFSET2                      0x3015
#define REG_ADC_SAT                          0x3016
#define REG_RMP_INIT                         0x3017
#define REG_RMP_OPTION                       0x3018

#define REG_CLP_LEVEL                        0x301D
#define REG_INRUSH_CTRL                      0x3021
#define REG_PUMP_RING_OSC                    0x3022
#define REG_PIX_VOLTAGE                      0x3024
#define REG_NTG_VOLTAGE                      0x3027

/*Pixel option setting*/
#define REG_PIXEL_BIAS                       0x301C
#define REG_ALL_TX_OFF                       0x30D8

/*ADLC SETTING*/
#define REG_L_ADLC_BPR                       0x3070
#define REG_F_L_ADLC_MAX                     0x3071
#define REG_F_ADLC_FILTER_A                  0x3080
#define REG_F_ADLC_FILTER_B                  0x3081

#define REG_SYNC_MODE                        0x3084
#define REG_M_PCLK_DIV                       0x30BE
#define REG_OUTIF_NUM_OF_LANES               0x30E2
#define REG_DPHY_BANDCTRL                    0x30F1
#define REG_PCLK_INV                         0x3110
#define REG_PCLK_DELAY                       0x3117
#define REG_V_H_SYNC_STRENGTH                0x3119
#define REG_DATA_PCLK_STRENGTH               0x311A

#define REG_ANALOGUE_GAIN_CODE_GLOBAL_MSB    0x0204
#define REG_ANALOGUE_GAIN_CODE_GLOBAL_LSB    0x0205
#define REG_FINE_INTEGRATION_TIME            0x0200
#define REG_COARSE_INTEGRATION_TIME          0x0202
#define REG_COARSE_INTEGRATION_TIME_LSB      0x0203

/* Mode select register */
#define S5K4E1GX_REG_MODE_SELECT             0x0100
#define S5K4E1GX_MODE_SELECT_STREAM          0x01    /* start streaming */
#define S5K4E1GX_MODE_SELECT_SW_STANDBY      0x00    /* software standby */

#define S5K4E1GX_REG_SOFTWARE_RESET          0x0103
#define S5K4E1GX_SOFTWARE_RESET              0x01

#define S5K4E1GX_REG_GROUP_PARAMETER_HOLD    0x0104
#define S5K4E1GX_GROUP_PARAMETER_HOLD        0x01
#define S5K4E1GX_GROUP_PARAMETER_UNHOLD      0x00

#define REG_TEST_PATTERN_MODE                0x0601

#define S5K4E1GX_AF_I2C_ADDR                 0x18
#define S5K4E1GX_STEPS_NEAR_TO_CLOSEST_INF   50
#define S5K4E1GX_TOTAL_STEPS_NEAR_TO_FAR     28
#define S5K4E1GX_SW_DAMPING_STEP             10
#define S5K4E1GX_SW_DAMPING_STEP2            4
#define S5K4E1GX_MAX_FPS                     20

#define S5K4E1GX_MAX_SNAPSHOT_EXP_LC         3961

struct reg_struct {
	uint8_t pre_pll_clk_div;                  /* 0x0305 */
	uint8_t pll_multiplier_msb;               /* 0x0306 */
	uint8_t pll_multiplier_lsb;               /* 0x0307 */
	uint8_t vt_sys_clk_div;                   /* 0x30B5 */
	uint8_t x_output_size_msb;                /* 0x034C */
	uint8_t x_output_size_lsb;                /* 0x034D */
	uint8_t y_output_size_msb;                /* 0x034E */
	uint8_t y_output_size_lsb;                /* 0x034F */
	uint8_t x_even_inc;                       /* 0x0381 */
	uint8_t x_odd_inc;                        /* 0x0383 */
	uint8_t y_even_inc;                       /* 0x0385 */
	uint8_t y_odd_inc;                        /* 0x0387 */
	uint8_t h_binning;                        /* 0x30A9 */
	uint8_t v_binning;                        /* 0x300E */
	uint8_t frame_length_lines_msb;           /* 0x0340 */
	uint8_t frame_length_lines_lsb;           /* 0x0341 */
	uint8_t line_length_pck_msb;              /* 0x0342 */
	uint8_t line_length_pck_lsb;              /* 0x0343 */
	uint8_t ld_start;                         /* 0x3000 */
	uint8_t sl_start;                         /* 0x3001 */
	uint8_t rx_start;                         /* 0x3002 */
	uint8_t cds_start;                        /* 0x3003 */
	uint8_t smp_width;                        /* 0x3004 */
	uint8_t az_width;                         /* 0x3005 */
	uint8_t s1r_width;                        /* 0x3006 */
	uint8_t tx_start;                         /* 0x3007 */
	uint8_t tx_width;                         /* 0x3008 */
	uint8_t stx_width;                        /* 0x3009 */
	uint8_t dtx_width;                        /* 0x300A */
	uint8_t rmp_rst_start;                    /* 0x300B */
	uint8_t rmp_sig_start;                    /* 0x300C */
	uint8_t rmp_lat;                          /* 0x300D */
	uint8_t smp_en;                           /* 0x3010 */
	uint8_t rst_mx;                           /* 0x3011 */
	uint8_t sig_offset1;                      /* 0x3012 */
	uint8_t rst_offset1;                      /* 0x3013 */
	uint8_t sig_offset2;                      /* 0x3014 */
	uint8_t rst_offset2;                      /* 0x3015 */
	uint8_t adc_sat;                          /* 0x3016 */
	uint8_t rmp_init;                         /* 0x3017 */
	uint8_t rmp_option;                       /* 0x3018 */
	uint8_t clp_level;                        /* 0x301D */
	uint8_t inrush_ctrl;                      /* 0x3021 */
	uint8_t pump_ring_osc;                    /* 0x3022 */
	uint8_t pix_voltage;                      /* 0x3024 */
	uint8_t ntg_voltage;                      /* 0x3027 */
	uint8_t pixel_bias;                       /* 0x301C */
	uint8_t all_tx_off;                       /* 0x30D8 */
	uint8_t l_adlc_bpr;                       /* 0x3070 */
	uint8_t f_l_adlc_max;                     /* 0x3071 */
	uint8_t f_adlc_filter_a;                  /* 0x3080 */
	uint8_t f_adlc_filter_b;                  /* 0x3081 */
	uint8_t sync_mode;                        /* 0x3084 */
	uint8_t pclk_inv;                         /* 0x3110 */
	uint8_t pclk_delay;                       /* 0x3117 */
	uint8_t v_h_strength;                     /* 0x3119 */
	uint8_t data_pclk_strength;               /* 0x311A */
	uint8_t analogue_gain_code_global_msb;    /* 0x0204 */
	uint8_t analogue_gain_code_global_lsb;    /* 0x0205 */
	uint8_t fine_integration_time;            /* 0x0200 */
	uint8_t coarse_integration_time;          /* 0x0202 */
	uint32_t  size_h;
	uint32_t  blk_l;
	uint32_t  size_w;
	uint32_t  blk_p;
};

struct reg_struct s5k4e1gx_reg_pat[2] = {
	{/*Preview*/
		0x06,  /* pre_pll_clk_div               REG=0x0305 */
		0x00,  /* pll_multiplier_msb            REG=0x0306 */
		0x90,  /* pll_multiplier_lsb            REG=0x0307 */
		0x01,  /* vt_sys_clk_div                REG=0x30B5 */
		0x05,  /* x_output_size_msb             REG=0x034C */
		0x18,  /* x_output_size_lsb             REG=0x034D */
		0x03,  /* y_output_size_msb             REG=0x034E */
		0xD4,  /* y_output_size_lsb             REG=0x034F */
		0x01,  /* x_even_inc                    REG=0x0381 */
		0x01,  /* x_odd_inc                     REG=0x0383 */
		0x01,  /* y_even_inc                    REG=0x0385 */
		0x03,  /* y_odd_inc                     REG=0x0387 */
		0x02,  /* h_binning                     REG=0x30A9 */
		0xAB,  /* v_binning                     REG=0x300E */
